# Exercises

1) Write a query to find first name and last name of employees whose first name:
- has 3 letters
- ends in 'a'

In [2]:
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [3]:
%sql sqlite:///my_database.db

In [4]:
%%sql
SELECT first_name, last_name
FROM employees
WHERE LENGTH(first_name) = 3 AND  first_name LIKE '%a';

 * sqlite:///my_database.db
Done.

[('Eva', 'Brown')]

2) Write a query to find, for each department:
- the name of the department
- the number of employees
- the number of employees who received a bonus
- the total amount of bonuses disbursed

In [5]:
%%sql
SELECT d.name AS department_name,
    COUNT(e.id) AS num_employees,
    COUNT(e.bonus) AS num_bonus_received,
    SUM(e.bonus) AS total_bonus_disbursed
FROM employees e
JOIN departments d ON e.department_id = d.id
GROUP BY d.name
ORDER BY num_employees DESC

 * sqlite:///my_database.db
Done.

[('Sales', 3, 2, 10000.0),
 ('Engineering', 3, 2, 15000.0),
 ('Marketing', 2, 1, 5000.0),
 ('HR', 2, 2, 6000.0),
 ('Finance', 2, 1, 4500.0)]

# Bonus exercise
3) Write a query to find employees who received the same bonus as at least one other employee.

*Soluzione con una Self-Join*

In [6]:
%%sql
SELECT e1.first_name, e1.last_name, e1.bonus
FROM employees e1
JOIN employees e2
ON e1.bonus = e2.bonus
AND e1.id != e2.id

 * sqlite:///my_database.db
Done.

[('Bob', 'Johnson', 5000.0), ('Ivy', 'Moore', 5000.0)]

Ho usato e1.id != e2.id per evitare il confronto del dipendente con se stesso